# Brewfile - Additional packages to install after bootstrap
# Install with: brew bundle --file=~/.local/share/chezmoi/Brewfile

# Taps
tap "homebrew/cask-fonts"

# CLI Tools
brew "htop"
brew "tree"
brew "jq"
brew "yq"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "zoxide"

# Development
brew "node"
brew "python@3.12"
brew "go"

# Applications
cask "visual-studio-code"
cask "iterm2"
cask "rectangle"
cask "docker"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
